src/CF/Catalogs/ОбъектыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ОбъектыКлиентов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаннаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Локации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроСвязанныеКлиенты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроЗакрепленныеСотрудники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязанныеКлиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗакрепленныеСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольСотрудника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ОбъектыКлиентов/Ext/ManagerModule.bsl
// sza150503-0132 
// sza140305-0303  
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	ТабДок.ИмяПараметровПечати  = "ОбъектКиентов" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТабДок.Очистить();
	
	СсылкаНаОбъектПечати = Ссылка[0];
	
	РазрядМетаданных = ""; ИмяМетаданных = "";
	ПроизвольнаяПечатнаяФорма = ОбщийМодульТекстСервер.ОпределитьПроизвольнуюПечатнуюФорму(, , СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
	
	Если ЗначениеЗаполнено(ПроизвольнаяПечатнаяФорма) Тогда
		ТабДок = ОбщийМодульТекстСервер.СформироватьДокументПоПроизвольнойФорме(ПроизвольнаяПечатнаяФорма, , ТабДок, СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
		
	Иначе		
		Макет = Справочники.ОбъектыКлиентов.ПолучитьМакет("НаПечать");
		Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов(Ссылка[0].СвязанныйКлиент);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ОбъектыКлиентов.ДатаРедакции,
		|	ОбъектыКлиентов.ДатаСоздания,
		|	ОбъектыКлиентов.КатегорияОбъекта,
		|	ОбъектыКлиентов.Код,
		|	ОбъектыКлиентов.Комментарий,
		|	ОбъектыКлиентов.Наименование,
		|	ОбъектыКлиентов.НоменклатурнаяГруппа,
		|	ОбъектыКлиентов.Ответственный,
		|	ОбъектыКлиентов.Регион,
		|	ОбъектыКлиентов.СвязаннаяНоменклатура,
		|	ОбъектыКлиентов.СвязанныйКлиент,
		|	ОбъектыКлиентов.Стоимость,
		|	ОбъектыКлиентов.СвязанныеКлиенты.(
		|		НомерСтроки,
		|		Клиент,
		|		РольКлиента,
		|		ОСтроке ),
		|	ОбъектыКлиентов.ЗакрепленныеСотрудники.(
		|		НомерСтроки,
		|		Сотрудник,
		|		РольСотрудника,
		|		ОСтроке )
		|ИЗ Справочник.ОбъектыКлиентов КАК ОбъектыКлиентов
		|ГДЕ ОбъектыКлиентов.Ссылка В (&Ссылка)";
		
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСвязанныеКлиентыШапка 	= Макет.ПолучитьОбласть("СвязанныеКлиентыШапка");
		ОбластьСвязанныеКлиенты 		= Макет.ПолучитьОбласть("СвязанныеКлиенты");
		ОбластьЗакрепленныеСотрудникиШапка = Макет.ПолучитьОбласть("ЗакрепленныеСотрудникиШапка");
		ОбластьЗакрепленныеСотрудники 		= Макет.ПолучитьОбласть("ЗакрепленныеСотрудники");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ВставлятьРазделительСтраниц = ЛОЖЬ;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ВыборкаСвязанныеКлиенты = Выборка.СвязанныеКлиенты.Выбрать();
			Если НЕ ВыборкаСвязанныеКлиенты.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСвязанныеКлиентыШапка);
				ТабДок.Вывести(ОбластьСвязанныеКлиентыШапка);
				
				Пока ВыборкаСвязанныеКлиенты.Следующий() Цикл
					ОбластьСвязанныеКлиенты.Параметры.Заполнить(ВыборкаСвязанныеКлиенты);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСвязанныеКлиенты);
					ТабДок.Вывести(ОбластьСвязанныеКлиенты, ВыборкаСвязанныеКлиенты.Уровень());
				КонецЦикла;	
			КонецЕсли;
			
			ВыборкаЗакрепленныеСотрудники = Выборка.ЗакрепленныеСотрудники.Выбрать();
			Если НЕ ВыборкаЗакрепленныеСотрудники.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудникиШапка);
				ТабДок.Вывести(ОбластьЗакрепленныеСотрудникиШапка);
				
				Пока ВыборкаЗакрепленныеСотрудники.Следующий() Цикл
					ОбластьЗакрепленныеСотрудники.Параметры.Заполнить(ВыборкаЗакрепленныеСотрудники);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудники);
					ТабДок.Вывести(ОбластьЗакрепленныеСотрудники, ВыборкаЗакрепленныеСотрудники.Уровень());
				КонецЦикла;	
			КонецЕсли;
			
			Подвал.Параметры.Заполнить(Выборка);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Подвал);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = ИСТИНА;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
